#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВХранилище = Параметры.АдресДанных;
	ЗагрузитьДанныеИзВременногоХранилища(АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанныеИзВременногоХранилища(АдресВХранилище)
		
    Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если Данные = Неопределено Тогда
        Сообщить("Данные не найдены во временном хранилище");
        Возврат;
    КонецЕсли;
	
    Диаграмма = Элементы.Диаграмма;
    Диаграмма.Очистить();
		
    СозданныеСерии = Новый Соответствие;
    
    Для Каждого Запись Из Данные Цикл
		
		ИмяСотрудника = Строка(Запись.Сотрудник);
        
        Серия = СозданныеСерии.Получить(ИмяСотрудника);
		
		Если Серия = Неопределено Тогда
            Серия = Диаграмма.Серии.Добавить();
            Серия.Текст = ИмяСотрудника; 
			СозданныеСерии[ИмяСотрудника] = Серия;
        КонецЕсли;
        
        Точка = Диаграмма.Точки.Добавить();
        Точка.Текст = ИмяСотрудника;
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
        
		Интервал = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала; 
		Интервал.Конец = Запись.ДатаОкончания; 
		Интервал.Текст = "Отпуск"; 
		
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти