
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ПроверкаДоговораСАбонентскимОбслуживанием();
		
	ДвиженияВыполненныеКлиентуРаботы();
		
	ДвиженияВыполненныеСотрудникомРаботы();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
    Если ЭтоНовый() Тогда
        ДобавитьУведомление("Создан новый документ обслуживания клиента: " + Ссылка);
        Возврат;
    КонецЕсли;

    СтарыйДокумент = Документы.ВКМ_ОбслуживаниеКлиента.ПолучитьСсылку();

    Если (СтарыйДокумент.Дата <> Дата) ИЛИ
       (СтарыйДокумент.Специалист <> Специалист) Тогда

        ТекстУведомления = "Изменён документ обслуживания клиента " + Ссылка + ":";

        Если СтарыйДокумент.Дата <> Дата Тогда
            ТекстУведомления = ТекстУведомления + Символы.ПС +
                "Дата: " + СтарыйДокумент.Дата + " → " + Дата;
        КонецЕсли;

        Если СтарыйДокумент.Специалист <> Специалист Тогда
            ТекстУведомления = ТекстУведомления + Символы.ПС +
                "Специалист: " + СтарыйДокумент.Специалист + " → " + Специалист;
        КонецЕсли;

        ДобавитьУведомление(ТекстУведомления);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияВыполненныеКлиентуРаботы()
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
    Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();

    Для Каждого Строка Из ВыполненныеРаботы Цикл

        СтавкаЧаса = ПолучитьСтоимостьЧасаИзДоговора(Договор);

        СуммаКВыплате = Строка.ФактическиПотраченоЧасов * СтавкаЧаса;

        Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Договор = Договор;
		Движение.Клиент = Клиент;
        Движение.КоличествоЧасов = Строка.ФактическиПотраченоЧасов;
        Движение.СуммаКОплате = СуммаКВыплате;

	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияВыполненныеСотрудникомРаботы()
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	               |	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	               |	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |			ПРАВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	               |			ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	               |		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВКМ_ОбслуживаниеКлиента.Специалист
	               |ГДЕ
	               |	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтавкаЧаса = ПолучитьСтоимостьЧасаИзДоговора(Договор);
		
		СуммаКОплате = Выборка.ФактическиПотраченоЧасов * СтавкаЧаса * Выборка.ПроцентОтРабот / 100;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Специалист;
		Движение.ЧасовКОплате = Выборка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = СуммаКОплате;
		
	КонецЦикла;
		
КонецПроцедуры	

Процедура ПроверкаДоговораСАбонентскимОбслуживанием()
	
	Договор = ЭтотОбъект.Договор;

    Если Договор = Неопределено Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не выбран договор!";
        Сообщение.Поле = "Договор";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    ДанныеДоговора = Договор.ПолучитьОбъект();

    Если ДанныеДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Договор должен иметь тип 'Абонентская плата'!";
        Сообщение.Поле = "Договор";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;

	ДатаДокумента = ЭтотОбъект.Дата;
    ДатаНачалаДействия = ДанныеДоговора.ВКМ_ДатаНачала;
    ДатаОкончанияДействия = ДанныеДоговора.ВКМ_ДатаОкончания;

    Если ДатаДокумента < ДатаНачалаДействия ИЛИ ДатаДокумента > ДатаОкончанияДействия Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = СтрШаблон(
            "Дата документа %1 не входит в период действия договора (%2 - %3)!",
            ДатаДокумента,
            ДатаНачалаДействия,
            ДатаОкончанияДействия);
        Сообщение.Поле = "Дата";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
	КонецЕсли;

КонецПроцедуры	

Функция ПолучитьСтоимостьЧасаИзДоговора(Договор)

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
                   |ИЗ
                   |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                   |ГДЕ
                   |	ДоговорыКонтрагентов.Ссылка = &ДоговорСсылка";

    Запрос.УстановитьПараметр("ДоговорСсылка", Договор);
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.СтоимостьЧасаРаботы;
    Иначе
        ВызватьИсключение "Ставка часа не указана в договоре " + Договор;
    КонецЕсли;

КонецФункции

Процедура ДобавитьУведомление(Текст)
	
	НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
    НовыйЭлемент.ТекстСообщения = Текст;
    НовыйЭлемент.Записать(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
