#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОчиститьТабЧасть();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток КАК Сумма
	               |ИЗ
	               |	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты,
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&Период, &Период, , , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты
	               |ГДЕ
	               |	ВКМ_ВыплатаЗарплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата); 
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить(); 
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Строка = Объект.Выплаты.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			
		КонецЦикла;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Задолженности перед сотрудниками нет";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабЧасть()
	
	Объект.Выплаты.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОчиститьТабЧасть();
	
КонецПроцедуры

#КонецОбласти

