#language: ru

@tree

Функционал: Создание документов «Реализация»

Как Бухгалтер я хочу
сформировать отчет Анализ выставленных актов 
чтобы проанализировать    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание документов «Реализация»

И В командном интерфейсе я выбираю "Работа с заявками клиентов" "Анализ выставленных актов"
Тогда открылось окно "Основной"
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение'
И я нажимаю на кнопку с именем 'СформироватьОтчет'
И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение' я ввожу текст "  .  .       :  :  "
И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение' я ввожу текст "  .  .       :  :  "
И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение' я ввожу текст "  .  .       :  :  "
И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение' я ввожу текст "  .  .       :  :  "









