
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОбновитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьРеквизитов()
	
    Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
        Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
    Иначе
		
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
        Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;

	КонецЕсли;
	
КонецПроцедуры

