
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
		
    НоменклатураАбонентскойПлаты = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРаботСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

    Если НоменклатураАбонентскойПлаты = Неопределено ИЛИ НоменклатураРаботСпециалиста = Неопределено Тогда
        ВызватьИсключение "Не заполнены константы номенклатуры для абонентской платы или работ специалиста!";
    КонецЕсли;
			
    НачалоМесяца = НачалоМесяца(Дата);
    КонецМесяца = КонецМесяца(Дата);

	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК Сумма,
                   |	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК Количество
                   |ИЗ
                   |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
                   |ГДЕ
                   |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = &Договор";

    Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
    Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
    Запрос.УстановитьПараметр("Договор", Договор);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	
	Услуги.Очистить();

    Если Выборка.Следующий() Тогда

		НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураРаботСпециалиста;
        НоваяСтрока.Количество = Выборка.Количество;
        НоваяСтрока.Цена = Выборка.Сумма / Выборка.Количество; 
		НоваяСтрока.Сумма = Выборка.Сумма; 
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
