
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СозданиеРеализаций(ПараметрыОперации) Экспорт
	
	Период = ПараметрыОперации.Период;
	НачалоМесяца = НачалоМесяца(Период.ДатаНачала);
	КонецМесяца = КонецМесяца(Период.ДатаОкончания);
	
	ВидАбонентскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидАбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("ВидАбонентскоеОбслуживание", ВидАбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	КоличествоДокументов = ТаблицаДокументов.Количество();
	
	ТекущийОбъект = Неопределено;
	
	Если КоличествоДокументов >= 1 Тогда
		
		Строка = ТаблицаДокументов[0];
		ТекущийДокумент = Строка.Реализация;
		ТекущийОбъект = ТекущийДокумент.ПолучитьОбъект();
		ТекущийОбъект.ВыполнитьАвтозаполнение();
		ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	ИначеЕсли КоличествоДокументов = 0 Тогда	
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		НовыйДокумент.Дата = НачалоМесяца;
		НовыйДокумент.ВыполнитьАвтозаполнение();
		
		ТекущийОбъект = НовыйДокумент;
		ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);	
		
	КонецЕсли;
	
	Возврат ТекущийОбъект;
	
КонецФункции

#КонецОбласти

#КонецЕсли

	
