#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВсеДлительностиОтпусков();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресДанных = АнализГрафикаНаСервере();
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
    ДанныеДляАнализа = Новый Массив;
    ТабличнаяЧасть = Объект.ОтпускаСотрудников;
    
    Для Каждого Строка Из ТабличнаяЧасть Цикл
        Запись = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
        Запись.Сотрудник = Строка.Сотрудник;
        Запись.ДатаНачала = Строка.ДатаНачала;
        Запись.ДатаОкончания = Строка.ДатаОкончания;
        ДанныеДляАнализа.Добавить(Запись);
    КонецЦикла;
    
    АдресДанных = ПоместитьВоВременноеХранилище(ДанныеДляАнализа, УникальныйИдентификатор);
    
    Возврат АдресДанных;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОбновитьТекущуюДлительностьОтпуска();
	ИнициализироватьУсловноеОформление();
	ОбновитьВсеДлительностиОтпусков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьУсловноеОформление()
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
  
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();    
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников"); 
    ПолеОформления.Использование = Истина;
 
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников.Длительность");   
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;    	
	ЭлементОтбора.ПравоеЗначение = 28;
    ЭлементОтбора.Использование  = Истина;
 
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущуюДлительностьОтпуска()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
    Длительность = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала) / 86400 + 1;
    ТекущиеДанные.Длительность = Длительность;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеДлительностиОтпусков()
	
	ТабличнаяЧасть = Объект.ОтпускаСотрудников;
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Если Строка.ДатаНачала <> Неопределено И Строка.ДатаОкончания <> Неопределено Тогда
            Строка.Длительность = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
        Иначе
            Строка.Длительность = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	


